[
    {
        "count": "2",
        "id": "10",
        "title": "前端程序员会不会被淘汰？",
        "content": "因为你视野不够才只能看到这些，你根本看不到现在大型电商类网站的工程复杂度，也不知道现在越来越多'toB'类应用开始提供Web化的服务，引入以前难以想象的业务复杂度。当然你更看不到现在一份代码多端运行适配需要的模块抽象能力。这些源于你没有脚踏实地的去开始学习，去看那些你现在垫着脚都看不到的景象。而把时间浑浑噩噩在『我学xx划不划算』、『学xx会不会更赚钱』学习、职业规划这东西，不要太贪，想笔直不曲的走上完美的路线，根本不可能。坑踩了才是你的经验，自己思考实践才是自己的积累。每个知识都有共通点，前端也一样。比如你可以发现，优秀的程序员往往抽象总结能力会比一般的职业好得多，更容易把零散的知识点整理成框架。这都跨行了，你还在纠结程序员的细分岗位？再回头看看你忧虑, 你看到工具生成的网页效果还不错，为什么你脑瓜子不清醒一些，去做那个开发更好工具的人，而不是考虑着工具是不是抢了你饭碗。 另外我也想吐槽一下，为什么现在知乎上越来越多年轻人，常常有这番景象刚学个Hello world 就『遇到了瓶颈怎么办』还没看个几页破书就『xxx，我该何去何从』还不知道自己能干嘛就『xx职业有是否有前途』这些孩子最终有成才的么？能不能给我个反例？我记得我刚工作那会，可是天天都觉得大把的事情压着，根本没这闲工夫思考这些东西。最近说话是糙了点，见谅。",
        "user": "bnbbs",
        "date": "2014-03-11 22:21:39"
    },
    {
        "count": "0",
        "id": "11",
        "title": "飞行员和空姐登机前拎的旅行箱里有什么？是私人物品吗？",
        "content": " 驾驶员的箱子东西不多，一般有几件衣服证件少量护肤品洗漱用品，我说的是国内过夜航班，盟机长说得很全面了。乘务员那就五花八门了：衣服，电脑，iPad，手电，大量化妆品，零食（常看见有带盒装周黑鸭的），安全套（并不是每个乘务员都有，只是极少数，并且我发誓我真不知道干什么用的。）。安全员：除了自用用品和证件。会携带警械登机，都有什么就不说了。但是会单独放在一个警具带里。补充一点：一般过夜航班国内机组会在戴箱子的同时带一个过夜包，设计的很科学。可以装制服，折起来还可以当一个包使用。。  PS：很奇怪我怎么知道的吧，尤其是关于安全套的故事。其实我只是机场的安检员。。。对，机组也是需要安检的，是不多余？另：广大crew同学们不要感觉自己的隐私就这样无情的暴露在屌丝安检员眼前。为了安全那是官话，其实除了我这样多年在机组通道执勤见得东西多了才知道外，广大安检员是根本不关心你包里有什么东西的，因为普通旅客限制携带的物品你们没有限制。所以大多数人乐得清闲，根本不会认真瞧机组的行李。。。还有，你们别以为X光机图像什么都看得出来，除违禁品外。生活物品分辨的真的是不太好，尤其是安全套这种橡胶材质的有机物。什么？你问我怎么能认识？还记得多年以前，那时我清纯羞涩，稚气未脱。刚刚进入安检队伍，一位善良的、经验丰富老前辈耐心的教我单位不会教的知识，告诉我：这，是安全套。这，是胸罩，这，是情趣玩具。这，是。。。。 如今，这些知识全部派上了用场。  那个啥，真没想到随口一调侃获得这么多赞同，看来这种爆隐私的回答是广大群众喜闻乐见的。话说我真的不是故意要把群众们的思维往那个方向引的。。我已经说了，我真的不知道CC带那啥是干啥的。因为曾看见有某个图腾为大鹏的airline整整一队人人有一盒，况且这东西真的不常见。。所以大家不要在腹黑的YY。。 还有，问我能不能看出小仓鼠那位仁兄，昨天晚上我刚查了一只小乌龟。还有一只小比熊狗狗我会乱说嘛？把宠物放包里容易闷死的你造吗？  ",
        "user": "bnbbs",
        "date": "2014-03-12 19:03:05"
    },
    {
        "count": "1",
        "id": "12",
        "title": "希望缓解眼睛干涩症状，什么眼药水最好？",
        "content": "Santen FX奈甲挫林(naphazoline)抗眼部充血剂通过使眼睛里面的血管收缩来让他们看起来变白并不能真正解决眼部干涩的问题眼睛血丝只是看起来变白了有研究表明这类药物会加剧眼睛干涩的症状长期使用后停止使用会让眼睛更容易干涩以及产生更严重的血丝症状。 和前面的几位答题者一样，我以前也是Santen FX的忠实粉丝，这玩意用了之后确实感觉非常的爽，特别是滴完之后一打开眼睛感觉浑身都凉得不行，红血丝也不见踪影。以至于有一段时间每次刷完题、打完游戏之后都要用几滴——直到我在Quora上看到一个眼科医生的回答！  或者其他宣称能够“GET THE RED OUT”的眼药水都含有  或者类似的成分，它是一种  ，  。但是这是一种治标不治本的方式，这类眼药水  ，你的  ，事实上  。更糟糕的是，这类药物还会产生一定的依赖性，  列出这位医生推荐的一些品牌的眼药水供大家参考，但大多数都是北美的牌子，似乎不那么容易在药店买到，可以考虑在淘宝购入，我自己尝试了Refresh Tears感觉非常好~  去年端午三天假期在宿舍几乎一整天都在床上玩手机，然后就开始眼睛干、涩、疼，更有时候不能被风吹日晒，风一吹就感觉眼睛里的液体秒干！！哗哗的灌风！黑暗里不能看手机屏幕，刺眼的疼。  网上查阅大量信息，怀疑干眼症（症状几乎全部符合！！！而且这病是慢性病几乎无法医治，就算一段时间好了之后还会反反复复，更有甚者会导致失明…我当时真真的被吓到了好吗！！！感觉我心灵的窗户从此就要别我而去了那个悔恨那个焦虑那个……(￣^￣)ゞ）遂去医院检查，检查结果除了近视没任何问题，医生很坚定得说就是平时用眼过度了，开了两瓶眼药水。不得不说那个包装从外到里都觉得很渣，但毕竟是正儿八经的眼科医院啊，总不该是假的吧，试了一下，但还是不放心，把两瓶都扔了。  ",
        "user": "bnbbs",
        "date": "2014-03-12 19:04:49"
    },
    {
        "count": "0",
        "id": "17",
        "title": "潜水被鲸鱼吞下去后还有自救的可能性吗？",
        "content": "问得一个好问题，下面来细细分析： 1.首先，你得被正确的鲸鱼吞食（什么样的鲸鱼能吞进去一个人？） 并不是每个鲸鱼都能轻易的吞进一个装备完善的人的。 根据生物上的分法，鲸是一个总的大目，其中又分须鲸亚目和齿鲸亚目。  须鲸亚目下的鲸都是鲸须滤食的方式捕捉小鱼小虾为食，因此它们食道普遍很窄，才几厘米最多10几厘米而已。体积最大的蓝鲸食道直径也才10cm而已。 而齿鲸拥有牙齿来捕获鱼或鱿鱼。 啊？那齿鲸有牙齿它不会咀嚼吗？ 别害怕，有一种齿鲸的牙齿并不是用来咀嚼食物的，而是用来捕捉猎物的，而且它的喉头很大，能吞下整只乌贼、章鱼和小鲨鱼。  2.如何被抹香鲸吃掉（鲸腹不是你想进，想进就能进） 首先，抹香鲸通常为海底300 -800米 ，有时1-2公里之间潜水寻找食物。以多种枪乌贼和深海鱼为主要食物。 因此你得下潜这么深。然后趁它东西的时候潜入嘴中。 （经知友提醒，貌似无法下潜这么深啊....只有等它上浮时不断骚扰它了。）  3.抹香鲸食道历险记 你现在被抹香鲸吞了下去，就像我们吞口水时会咽一下，抹香鲸吞食物的时候也是咽一下的，希望这时不会被食物互相挤死吧。 而且抹香鲸是有三个胃的。你首先进到的是抹香鲸第一个胃，它里面没有胃液也没有空气（空气罐派上作用了），但会不停的蠕动来用肌肉粉碎食物，所以亲要在被粉身碎骨前赶紧去下一个胃哦。 第二个，第三个会分泌胃酸。所以亲要把握机会快点出来哦不然就被腐蚀啦。 ",
        "user": "bnbbs",
        "date": "2014-03-14 11:39:44"
    },
    {
        "count": "2",
        "id": "18",
        "title": "你是从什么时候开始，感受到了岁月的残忍？",
        "content": "她年轻和年老时的电影我都看过, 年轻时敞亮单纯，精气神十足的感觉，但也感觉处处生涩无法掌控自己.年老的时候变得温和了很多,状态稳定也优雅，同时有种大妈的固执，看着也很亲切.要说岁月的残忍,老去是残忍的一个证据，更是死的象征。但死督促着我们在有限的时间内更好地成长,没有这种残忍谁愿意珍惜现在呢？有多少人愿意谈论活在当下呢？答题第一瞬间本想放我爸妈的对比照，但想想还是算了.一方面他们的变化才让我真切体会到岁月很残忍，同时另一方面我和他们的关系却比以前更好,相处更自如更能相互理解.我想这种经历所带来的感受就让它沉淀在心底,转成我对岁月有情的感恩好了.",
        "user": "bnbbs",
        "date": "2014-03-14 11:40:22"
    },
    {
        "count": "10",
        "id": "19",
        "title": "程序员想转行当医生，可行吗？",
        "content": "别逗了题主，正常人18岁上医科大学，23岁本科毕业考研，26岁硕士毕业考博，29岁博士毕业。并且这些都是一路顺风的情况下。现在又特么出台个住院医师规范化培训，要求在教学医院轮转三年充当免费劳动力，当然博士可以减免一年（各地政策不同，轮转期间待遇有好有差，一般不到两千，而且不给奖金）。轮转后32岁花了不少钱找了不少关系终于在大医院入编了。刚工作依旧苦逼，晋职称前面有一百多号人排队，何时能排到自己？自己终于晋职称了，结果出门诊被人一刀捅死。没错，很有可能！而且作为医学生，我们好像忘了结婚的事情，没错，我们没时间，也结不起。  既然大家都在打击题主，我来写点正经（？）的看看~不过值不值，题主自己判断。Disclaimer：本人非医科生，资料也未经过严谨考据。不过周围pre-med很多。如果题主真的下了决心，我也不介意帮你问问进度啊，备考经验一类。  一般理科生转行成医森的话，在美国是可行的。因为美国基本没有本科医学院，也只有少数学校有正式的pre-med这个专业。而医学院的录取，也并未硬性规定只收“特定专业”人士。在满足要求的条件下，其实CS男也有点自己的优势啊~比如我见过的CS男一般数学都非常好，而这一点，medical school也是很欣赏的。  你可能是想直接读个国内医学院的研究生然后当医生？这是不行的，临床执业医师执照要求本科是临床医学或者研究生是临床型，跨专业考入的绝对是做科研型，没有资格考临床执照。此外我还没有见过如此大的跨专业，不晓得政策是否允许，通常我们说的跨专业都是从预防医学什么的跨到临床来。  所以正道是你得重新考大学，最节约时间的路是八年制，但收分挺高，我连看了两届学弟的分，都是全省前1～5/1000的样子。那要不就是五年制，然后读硕读博，别的答案也给分析了，这样从现在开始需要的时间至少是10-11年，加上明年开始住院医师规培制度全面实行，到10年后的政策下怕是博士还要再做2年规培才能正式从医？所以不管你走什么学制，想像其他规范培养的医师一样就得十多年，这十多年没有多少收入，你算算是否耗得起。何况别人到40岁怎么都开始独当一面了，你这样到40岁还要跟在同龄人屁股后面跟10年才能和他们一样，我敢说你得不到想要的成就感的。 ",
        "user": "bnbbs",
        "date": "2014-03-14 11:41:46"
    },
    {
        "count": "1",
        "id": "20",
        "title": "问题儿童都来自异世界中有哪些种族?",
        "content": "故事讲述的是对世界已经厌烦的逆回十六夜在某一天收到了一封邀请函。当他看清邀请函中写着的内容：“望你舍弃一切，前来「箱庭」”的瞬间──他来到了完美无缺的异世界。出现在十六夜眼前是带著猫的沉默少女与态度高傲的大小姐，还有召唤他们三人来到异世界的罪魁祸首——黑兔。当黑兔正在为他们说明箱庭世界的规则时，十六夜却突然表示：“来打倒魔王吧！”。可是黑兔没有拜托他们做那样的事情，三个超级问题儿和黑兔的明天最终将会前往何方？这部既充满着幻想元素又时时令人捧腹大笑的故事就此开始了。",
        "user": "bnbbs",
        "date": "2016-03-14 17:59:30"
    },
    {
        "count": "0",
        "id": "21",
        "title": "80% 应聘者都不及格的 JS 面试题？",
        "content": "招聘前端工程师，尤其是中高级前端工程师，扎实的 JS 基础绝对是必要条件，基础不扎实的工程师在面对前端开发中的各种问题时大概率会束手无策。在考察候选人 JS 基础的时候，我经常会提供下面这段代码，然后让候选人分析它实际运行的结果：for (var i = 0; i < 5; i++) { setTimeout(function() { console.log(new Date, i); }, 1000);}console.log(new Date, i);",
        "user": "lcqlcq",
        "date": "2017-04-04 20:59:50"
    }
]